// Сумма введённых чисел
// важность: 4
// Напишите функцию sumInput(), которая:

// Просит пользователя ввести значения, используя prompt и сохраняет их в массив.
// Заканчивает запрашивать значения, когда пользователь введёт не числовое значение, пустую строку или нажмёт «Отмена».
// Подсчитывает и возвращает сумму элементов массива.
// P.S. Ноль 0 – считается числом, не останавливайте ввод значений при вводе «0».

// let arr = [];

// function sumInput() {
//     let num;
//     let result = 0;
//     do {
//         num = prompt('Enter a number');
//         if (isFinite(num)) {
//             arr.push(+num)
//             result += +num;
//         }

//     } while (isFinite(num) && num !== '');

//     return result;
// };

// console.log(arr);
// console.log(sumInput());
// console.log(arr);